export const KanbanMock = [
  {
    id: 1,
    title: "[기획자] 지원서",
    column: [
      {
        id: 10,
        major: "소프트웨어공학과",
        title: "[기획자] 임채승",
        apply: ["APP", "WEB"],
        comment: 14,
        heart: 6,
        isHearted: true,
      },
      {
        id: 2,
        major: "소프트웨어공학과",
        title: "[기획자] 임채승",
        apply: ["APP", "WEB"],
        comment: 14,
        heart: 6,
        isHearted: false,
      },
      {
        id: 11,
        major: "산업공학과",
        title: "[기획자] 김지민",
        apply: ["APP", "WEB"],
        comment: 14,
        heart: 6,
        isHearted: false,
      },
      {
        id: 12,
        major: "산업공학과",
        title: "[기획자] 김지민",
        apply: ["APP", "WEB"],
        comment: 14,
        heart: 6,
        isHearted: false,
      },
    ],
  },
  {
    id: 2,
    title: "[개발자] 지원서",
    column: [
      {
        id: 3,
        major: "소프트웨어공학과",
        title: "[개발자] 이서현",
        apply: ["APP", "WEB"],
        comment: 14,
        heart: 6,
        isHearted: true,
      },
      {
        id: 4,
        major: "소프트웨어공학과",
        title: "[개발자] 이서현",
        apply: ["APP", "WEB"],
        comment: 14,
        heart: 6,
        isHearted: false,
      },
    ],
  },
  {
    id: 3,
    title: "[디자이너] 지원서",
    column: [
      {
        id: 5,
        major: "소프트웨어공학과",
        title: "[디자이너] 김서하",
        apply: ["APP", "WEB"],
        comment: 14,
        heart: 6,
        isHearted: true,
      },
      {
        id: 6,
        major: "소프트웨어공학과",
        title: "[디자이너] 김서하",
        apply: ["APP", "WEB"],
        comment: 14,
        heart: 6,
        isHearted: false,
      },
    ],
  },
];

export const ApplicantCommentMock = [
  {
    id: 1,
    author: "22기 박수현",
    date: "2033.02.21",
    content:
      "지원서, 기획서, 포트폴리오 모두 정말 정성적으로 작성해주신 점 좋았습니다. 현재 병행하고 계신 활동, 특히 동아리 관련 활동이 많으신데 실질적으로 에코노베이션에 할애할 수 있는 시간이 어느정도일지 궁금합니다.",
    like: 2,
    checked: true,
  },
  {
    id: 2,
    author: "22기 박수현",
    date: "2033.02.21",
    content:
      "지원서, 기획서, 포트폴리오 모두 정말 정성적으로 작성해주신 점 좋았습니다. 현재 병행하고 계신 활동, 특히 동아리 관련 활동이 많으신데 실질적으로 에코노베이션에 할애할 수 있는 시간이 어느정도일지 궁금합니다.",
    like: 4,
    checked: false,
  },
  {
    id: 3,
    author: "22기 김서하",
    date: "2033.02.21",
    content:
      "지원서, 기획서, 포트폴리오 모두 정말 정성적으로 작성해주신 점 좋았습니다. 현재 병행하고 계신 활동, 특히 동아리 관련 활동이 많으신데 실질적으로 에코노베이션에 할애할 수 있는 시간이 어느정도일지 궁금합니다.",
    like: 2,
    checked: false,
  },
];

export const ApplicationListMock = [
  {
    title: "[개발자] 임채승",
    apply: ["APP", "WEB"],
    semester: "1학년 1학기",
    registerDate: "2023.03.31",
  },
  {
    title: "[개발자] 임채승",
    apply: ["APP", "WEB"],
    semester: "1학년 1학기",
    registerDate: "2023.03.31",
  },
  {
    title: "[개발자] 임채승",
    apply: ["APP", "WEB"],
    semester: "1학년 1학기",
    registerDate: "2023.03.31",
  },
  {
    title: "[개발자] 임채승",
    apply: ["APP", "WEB"],
    semester: "1학년 1학기",
    registerDate: "2023.03.31",
  },
  {
    title: "[개발자] 임채승",
    apply: ["APP", "WEB"],
    semester: "1학년 1학기",
    registerDate: "2023.03.31",
  },
  {
    title: "[개발자] 임채승",
    apply: ["APP", "WEB"],
    semester: "1학년 1학기",
    registerDate: "2023.03.31",
  },
  {
    title: "[개발자] 임채승",
    apply: ["APP", "WEB"],
    semester: "1학년 1학기",
    registerDate: "2023.03.31",
  },
];

export const InterviewListMock = [
  {
    title: "[개발자] 임채승",
    apply: ["APP", "WEB"],
    score: "4.5",
    registerDate: "2023.03.31",
  },
  {
    title: "[개발자] 임채승",
    apply: ["APP", "WEB"],
    score: "4.5",
    registerDate: "2023.03.31",
  },
  {
    title: "[개발자] 임채승",
    apply: ["APP", "WEB"],
    score: "4.5",
    registerDate: "2023.03.31",
  },
  {
    title: "[개발자] 임채승",
    apply: ["APP", "WEB"],
    score: "4.5",
    registerDate: "2023.03.31",
  },
  {
    title: "[개발자] 임채승",
    apply: ["APP", "WEB"],
    score: "4.5",
    registerDate: "2023.03.31",
  },
  {
    title: "[개발자] 임채승",
    apply: ["APP", "WEB"],
    score: "4.5",
    registerDate: "2023.03.31",
  },
  {
    title: "[개발자] 임채승",
    apply: ["APP", "WEB"],
    score: "4.5",
    registerDate: "2023.03.31",
  },
];

export const InterviewScoreMock = [
  { score: "3.75", type: "passion", string: "열정" },
  { score: "4.00", type: "action", string: "실천력" },
  { score: "3.50", type: "collaboration", string: "협업" },
  { score: "2.75", type: "focus", string: "동아리 집중" },
  { score: "3.75", type: "eager", string: "간절함" },
];

export const InterviewCommentMock = [
  { name: "윤성", passion: 4, action: 4, collaboration: 4, focus: 4, eager: 4 },
  { name: "민주", passion: 4, action: 4, collaboration: 4, focus: 4, eager: 4 },
  { name: "서현", passion: 3, action: 3, collaboration: 3, focus: 3, eager: 3 },
];

export const InterviewRecode = `김건형

2022.09.22 목 오전 9:59 ・ 11분 52초


그럼 시작해볼게요 안녕하세요. 에코노베이션입니다. 
김건형 님 맞으신가요?

맞습니다.

저희가 공정한 선발 및 평가를 위한 면접 영상을 녹화하고 있습니다. 
영상 녹화에 동의하시나요?

네

영상에 음성이 잘 담길 수 있도록 가능한 큰 목소리로 답해 주시면 감사하겠습니다.

네 이 정도면 되나요?

조금만 더 크게 해 주시면 더 좋을 것 같습니다. 
김건형 님은 공강 시간에 주로 어디서 시간을 보내시나요?

제가 아직 휴학 중이라서 공강 시간이라는 걸 아직 체험해본 적이 없네요. 
근데 만약에 있다면, 만약에 동아리가 있다면 동아리실에 가서 내가 해야 할 과제라든지 그런 걸 할 것 같고 근데 만약에 동아리가 없다. 싶으면 제가 지금 자취하고 있는 집에 가깝기 때문에 아마 거기에 있지 않을까

그럼 아직 군 휴학 중이라고 하셨는데 아직 지금 복무 기간 중이신 건가요

아니요. 전역을 했고 네 이제 9월 15일부터

그러면 2학기까지는 휴학을 하시는 거네요

그게 짝학기 복학을 하면 좀 애매할 것 같아서

네 알겠습니다. 그러면 본격적으로 에코노베이션 24기 신입 모집 면접을 시작하도록 하겠습니다. 

네

본인에 대해서 간단히 소개해 주실 수 있을까요.

제 이름은 다 아시다시피 김건형이고요. 인공지능 확부에 지원을 해서 합격을 했습니다. 근데 이제 아직 다니고 있다라고 말씀드리지 못하는 이유는 제가 합격을 하고 바로 군대를 다녀왔기 때문에 아직 다녀본 경험은 없고 그래도 이제 관련 인공지능이나 약간 프로그래밍 관련해서 제가 어느 정도 능력이 있다고 말씀드릴 수 있는 거는 고등학교 때 제가 관련해서 프로젝트도 꽤 많이 진행을 해봤고 정보과학이라는 시간이 꽤 많았기 때문에 제가 그렇게 말씀드릴 수 있을 것 같습니다.

에코노베이션에 지원하게 된 계기가 무엇일까요.

네 제가 거기 지원서에도 작성을 했던 것 같은데 제가 군대 근무를 하면서 저 스스로 약간 목표를 세운 게 하루에 한 문제씩 이제 백준 알고리즘 문제를 풀어보자 약간 그런 거를 저 스스로 내걸고 했었는데 이제 하다 보니까 제가 전남대학교 소속으로 설정을 해놨더니 그 안에 랭킹이 이렇게 있는 거예요. 
그래서 랭킹을 보니까 꽤 높은 랭커분들께서 이제 자기 소개 정보 안에 에코노베이션 그렇게 적어놓은 분들이 꽤 많으셔서 여기가 지금 뭐 하는 데지 그래서 이제 찾아보게 되었더니 에코노베이션는 그렇게 일단 알게는 되었고
지원해야겠다라고 생각한 건 이제 관련된 유튜브 영상이나 인스타나 이런 걸 보면서 나도 여기 들어가면 즐겁게 프로젝트도 같이 하고 활동할 수 있겠다는 생각이 들어서 지원하게 됐습니다.

1지망을 인공지능 2지망을 웹으로 지원을 해 주셨는데 1지망 인공지능을 인공지능 학과라서가 아니라 인공지능으로 지원해 주신 이유가 따로 있을까요?

그렇죠 근데 이제 가장 큰 이유는 아무래도 인공지능 학부이긴 한데, 그전에 제가 고등학교 때 광학 문자 인식이라는 프로젝트를 한번 진행했었는데 이제 그 모델을 교육시키는 과정이 기계 학습이라는 과정을 통해서 교육을 했어야 했는데 사실은 그게 좀 힘들었어요. 교육시키는 과정이 꽤 힘들었고 제가 혼자 그때 제 친구 한 명이랑 같이 했었는데 둘이 하니까 이게 너무 어려운 거예요. 그래서 뭔가 앞에서 이끌어주는 사람이 있으면 좋겠다라는 생각도 많이 했었고 그래서 인공지능 관련으로 좀 더 관심이 이렇게 가게 됐던 것 같고 그래서 이쪽에서 지원을 해가지고 인공지능이 어떻게 교육되는지 또 어떤 방식이 효율적인지 이런 거에 대해서 배워보고 싶었습니다.

잘 들었습니다. 그러면 김건형 님께서 최근에 인공지능에 관심 있게 생각한 뉴스가 있다면 어떤 게 있을까요? 아니면 관심 있게 본 모델이 있을까요?

제가 거기에 이제 써놨듯이 인공지능 활용도 당연히 관심이 많지만 최근에 관심 있게 본 거는 AI 채색이라든지 혹은 어떤 사람의 얼굴을 다른 인물과 비슷하게 이렇게 변형시켜주는 그러한 모델들을 이제 보고 있는데, 제가 인공지능 지능에 관련해서 전문적인 지식이 있는 게 아니다 보니까 유튜브에 있는 강의 영상들을 항상 좀 찾아보곤 하는데 이제 거기에서 인공지능을 세 가지로 분류를 했었는데 하나가 이제 어떠한 사진이나 그런 것들을 분류해 주는 그런 인공지능이 모델이 하나 있고 하나는 방금 제가 말씀드린 것처럼 채색을 한다든지 다른 얼굴로 이렇게 닦아준다든지 하는 그런 분야가 또 하나 있고 나머지 하나는 이제 좀 최적화하는 알파고와 비슷한 이제 그런 세 개로 나눠진다는 강의는 이제 제가 봤었는데 아무래도 저는 두 번째 쪽에 관련된 것들이 관심이 많이 가는 것 같습니다.

감사합니다. 건형 님이 에코노베이션에 들어오고 난 후 또는 이제 복학하고 난 후에 본인의 이제 학업 계획에 대해서 간단하게 말씀해 주시면 감사하겠습니다.

학업 계획이라고 하시면 혹시 뭘 정확히

인공지능 쪽으로 이런 공부를 해보고 싶다거나 인공지능이 아니더라도 이런 공부를 할 계획이 있다거나 간단하게 말씀해 주시면 감사하겠습니다.

인공지능 같은 경우는 이제 인공지능을 교육시키는 방법이 여러 가지가 있는데 그중에 이제 경사 방법이라고 가장 많이 알고 있는 방법이 있지 않습니까? 경사 방법 같은 경우를 이제 제가 그 알고리즘을 이제 보면서 뭔가 이 알고리즘을 좀 더 다른 식으로 변형해보면 어떨까라는 생각을 좀 했었는데 실제로 그걸 제가 구현하기에는 아직 구현력도 조금은 부족하고 아니면 좀 최적화된 언어들을 파이썬으로 파이썬이나 심플로만 하기에는 살짝 힘든 느낌이 있어서 다른 언어도 이제 같이 병행해서 공부를 하면서 최종적으로는 인공지능을 어찌 됐든 교육시키는 과정 교육 시키는 방법 같은 거를 좀 공부를 할 생각입니다.

건형 님께서는 되게 프로젝트 경험도 많으시고 하시는데 혹시 만약에 프로젝트 프로그래밍을 처음. 
시작하게 된 팀원과 프로젝트를 진행할 경우 어떻게 프로젝트를 진행해 나가실지 궁금합니다.

프로젝트를 처음. 접해보는 팀원이라고.. 근데 이제 거기에 있어서는 저는 그렇게 생각하는데 저도 어떻게 보면 팀 프로젝트에 있어서는 그냥 그분과 똑같이 초보라고 생각을 하거든요. 왜냐하면 항상 저는 거의 혼자 두 명이 할 때도 이제 git나 그런 플랫폼을 이용해서 한 적이 없었고 항상 같은 학교에 있었다. 
보니까 그냥 얘기하면서 자연스럽게 하면 되는데 이제 대학교는 그런 환경이 갖춰 있지 않기 때문에 어떻게 보면 저랑 그분이랑 똑같이 초보라고 할 수 있을 것 같아요.  근데 이제 프로그래밍 능력이나 이런 거에서 좀 차이가 난다고 하면 사실 여기는 학교잖아요. 학교에서 내가 쟤보다 잘하니까 쟤랑은 그냥 안 해야겠다라는 건 사실 그렇게 좋은 자세는 아닌 것 같아요.
어느 정도 가르쳐주면서 내가 자기 자신에게 좀 이 개념을 내가 제대로 숙지하고 있구나라는 자기 확인이 되는 것도 있고 그렇기 때문에 아예 처음 한 사람이라면 제가 가르쳐주면서 그 중에서도 또 제가 얻어가는 게 많다는 걸 이제 고등학교 때 저도 저는 이미 느꼈었거든요. 그래서 같이 이렇게 가르쳐주면서 잘할 수 있을 것 같습니다.

원활한 협업을 위한 본인만의 의사소통 방법이 따로 있을까요?

일단 저는 상대방이 말을 할 때 끊지 않는 거를 굉장히 중요하게 생각을 합니다. 
왜냐하면 한국 말을 끝까지 들어봐야 된다 이런 말도 있잖아요. 
그런 말이 있는 이유가 끝에 가서 끝까지 들어야지만 그 논리가 완성되는 그런 주장들을 하는 사람들이 꽤 많기 때문에 끝까지 들어주는 것만 해주더라도 어느 정도 협업에 있어서 굉장히 큰 장점이 될 수 있을 거라고

혹시 건형 님이 생각하시는 본인의 단점이 무엇이라고 생각하시나요? 그리고 그 단점이 가장 잘 드러나는 순간은 언제라고 생각하세요?

단점이라고 하면은 이제 하나의 좀 진부한 말이 되겠지만 하나를 좀 파고들면 다른 거를 좀 어느 정도 신경을 배제하는 그런 경향이 좀 있습니다.  왜냐하면 저 고등학교 할 때도 사실은 시험 공부를 해야 되잖아요. 근데 이제 프로젝트를 하는 바람에 시험을 몇 번 잘 못 본 적도 있었고 그런 경우가 있는 만큼 어느 정도 프로젝트에 대한 열망이 좀 있다고 생각을 합니다. 네 꼭 프로젝트 아니라도 제가 빠져 있는 거에 대한 그런데 이제 여기 동아리 입장으로 봤을 때는 프로젝트를 사실 진행하는 동아리잖아요. 
그래서 다른 제 인생에서 봤을 때는 그게 사실 단점이겠지만 이 동아리 입장에서 봤을 때는 그게 오히려 강점으로 그렇게 부각이 될 수 있을 것 같아요.

그러면 이제 에코노베이션은 매주 금요일 오후 5시에 필수 참여 행사인 주간 발표가 있습니다. 
참여 가능하십니까

네

마지막으로 하고 싶은 말씀이나 궁금한 점 있을까요.

아 이런 거 여쭤봐도 되는지 모르겠는데 혹시 지금 제가 카톡방에 있는 사람 수를 봤는데 13명이신 것 같더라고요 그중에서 혹시 몇 명이나 뽑을 계획이신지

저희는 이제 항상 뽑을 때 수를 정해놓고 뽑지 않고요 대략 10명 내외 정도로 생각하시면 될 것 같습니다.

알겠습니다.

그러면 이제 에코노베이션에 합격하게 되면 신입 기수로 구성된 팀으로 프로젝트를 진행하게 됩니다. 
저희는 자기 주도적으로 학습하며 동료들과 함께 성장하는 동아리입니다. 
다양한 스터디 및 행사도 있으니 많은 관심 부탁드리겠습니다. 
최종 합격 결과는 9월 27일 화요일에 개별 공지될 예정이며 오리엔테이션 일자는 9월 29일 목요일 오후 7시로 반드시 참여하셔야 합니다.
한정된 인원을 선발해야 하는 동아리 사정상 같은 학생임에도 선발을 위한 면접을 보게 된 점 양해 부탁드리겠습니다 면접 보시느라 고생하셨습니다. 
나가보셔도 좋습니다. 수고하셨습니다.

29일 목요일 맞죠.

네 맞습니다. `;

export const ManagerListMock = [
  {
    name: "임채승",
    period: 22,
    type: "captin",
  },
  {
    name: "임채승",
    period: 22,
    type: "captin",
  },
  {
    name: "임채승",
    period: 22,
    type: "captin",
  },
  {
    name: "임채승",
    period: 22,
    type: "captin",
  },
  {
    name: "임채승",
    period: 22,
    type: "captin",
  },
  {
    name: "임채승",
    period: 22,
    type: "captin",
  },
  {
    name: "임채승",
    period: 22,
    type: "captin",
  },
];
